Repository: 00sa00/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/fallback_content/Conventions.po
Languages: es_es, pt_br

source: Document Conventions
es_es: Convenciones del documento
pt_br: Convenções de Documento

source: This manual uses several conventions to highlight certain words and phrases and draw attention to specific pieces of information.
es_es: Este manual utiliza varias convenciones para resaltar ciertas palabras y frases y centrar la atención en ciertas partes especificas de información.
pt_br: Este manual usa diversas convenções para destacar certas palavras, frases e chamar atenção às partes específicas de informação.

source: In PDF and paper editions, this manual uses typefaces drawn from the <ulink url="https://fedorahosted.org/liberation-fonts/">Liberation Fonts</ulink> set. The Liberation Fonts set is also used in HTML editions if the set is installed on your system. If not, alternative but equivalent typefaces are displayed. Note: Red Hat Enterprise Linux 5 and later includes the Liberation Fonts set by default.
es_es: En PDF y en las ediciones impresas, este manual utiliza una fuente del grupo <ulink url="https://fedorahosted.org/liberation-fonts/">Liberation Fonts</ulink>. El grupo Liberation Fonts también se utiliza en ediciones HTML si el grupo se encuentra instalado en su sistema. Si no, entonces se muestran fuentes alternas pero equivalentes. Nota: Red Hat Enterprise Linux 5 y posteriores incluye el grupo de Liberation Fonts por defecto.
pt_br: Nas edições de papel e PDF, este manual usa typefaces extraídas do conjunto <ulink url="https://fedorahosted.org/liberation-fonts/">Liberation Fonts</ulink>. O conjunto das Fontes de Liberação é também usado nas edições HTML, caso o conjunto for instalado no seu sistema. Caso isto não ocorra, typefaces alternativas (porém equivalentes) serão exibidas. Nota: o Red Hat Enterprise Linux 5 e versões superiores incluem o conjunto das Fontes de Liberação por padrão.

source: Typographic Conventions
es_es: Convenciones tipográficas
pt_br: Convenções Tipográficas

source: Four typographic conventions are used to call attention to specific words and phrases. These conventions, and the circumstances they apply to, are as follows.
es_es: Se utilizan cuatro convenciones tipográficas para captar la atención hacia palabras o frases específicas. A continuación encontrará estas convenciones y las circumstancias en las que se aplican:
pt_br: As quatro convenções tipográficas são usadas para chamar a atenção de palavras e frases específicas. Estas convenções e as circunstâncias em que elas aplicam são as seguintes:

source: Used to highlight system input, including shell commands, file names and paths. Also used to highlight keycaps and key combinations. For example:
es_es: Se utiliza para resaltar entradas del sistema, incluyendo comandos de shell, nombres de archivos y rutas. También se utiliza para resaltar combinaciones de teclas, por ejemplo:
pt_br: Usada para destacar a entrada do sistema, incluindo comandos de janela, nomes e caminhos de arquivo. Além disso, ela é usada para destacar keycaps e combinações de chaves. Por exemplo:

source: To see the contents of the file <filename>my_next_bestselling_novel</filename> in your current working directory, enter the <command>cat my_next_bestselling_novel</command> command at the shell prompt and press <keycap>Enter</keycap> to execute the command.
es_es: Para ver el contenido del archivo <filename>my_next_bestselling_novel</filename> en su directorio actual de trabajo, introduzca el comando <command>cat my_next_bestselling_novel</command> en el intérprete shell y teclee <keycap>Enter</keycap> para ejecutar el comando.
pt_br: Para verificar os conteúdos do <filename>my_next_bestselling_novel</filename> de arquivo em seu diretório de trabalho atual, entre o comando <command>cat my_next_bestselling_novel</command> na janela de comando e pressione <keycap>Enter</keycap> para executar o comando.

source: The above includes a file name, a shell command and a keycap, all presented in mono-spaced bold and all distinguishable thanks to context.
es_es: Lo anterior incluye un nombre de archivo, un un comando shell y un keycap, todos en negrilla mono-espacio y todos distinguibles gracias al contexto.
pt_br: Isto inclui o nome de arquivo, a janela de comando e um keycap, todos apresentados em negrito com um único espaço e todos distinguidos graças ao contexto.

source: Key combinations can be distinguished from keycaps by the hyphen connecting each part of a key combination. For example:
es_es: Las combinaciones teclas se pueden distinguir de los keycaps gracias al guión que conecta cada parte de una combinación de teclas. Por ejemplo:
pt_br: As combinações de chave podem ser distinguidas de keycaps por cada parte de conexão de hífen de uma combinação de chave. Por exemplo:

source: Press <keycap>Enter</keycap> to execute the command.
es_es: Teclee <keycap>Enter</keycap> para ejecutar el comando.
pt_br: Pressione <keycap>Enter</keycap> para executar o comando.

source: Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> to switch to the first virtual terminal. Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F7</keycap></keycombo> to return to your X-Windows session.
es_es: Teclee <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> para cambiar a la primera terminal virtual. Teclee <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F7</keycap></keycombo> para regresar a su sesión X-Windows.
pt_br: Pressione <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> para mudar para o primeiro terminal virtual. Pressione <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F7</keycap></keycombo> para retornar à sua sessão do X-Windows.

source: The first paragraph highlights the particular keycap to press. The second highlights two key combinations (each a set of three keycaps with each set pressed simultaneously).
es_es: El primer parrafo resalta el keycap en particular que debe teclear. El segundo resalta dos combinaciones de teclas (cada una es un grupo de tres keycaps con cada grupo tecleado de manera simultánea).
pt_br: O primeiro parágrafo destaca um keycap particular a pressionar. O segundo destaca duas combinações de chaves (sendo que cada uma é um conjunto de três keycaps com cada conjunto sendo pressionado simultaneamente).

source: If source code is discussed, class names, methods, functions, variable names and returned values mentioned within a paragraph will be presented as above, in <literal>mono-spaced bold</literal>. For example:
es_es: Si se aborda el código fuente entonces los nombres de las clases, métodos, funciones y los nombres de las variables y d elos valores retornados mencionados en un párrafo se presentará tal como se mencionó antes en <literal>mono-spaced bold</literal>. Por ejemplo:
pt_br: Caso o código de fonte for discutido, nomes de classe, métodos, funções, nomes variáveis e valores retornados e valores retornados mencionados com um parágrafo serão apresentados conforme acima, em <literal>mono-spaced bold</literal>. Por exemplo:

source: File-related classes include <classname>filesystem</classname> for file systems, <classname>file</classname> for files, and <classname>dir</classname> for directories. Each class has its own associated set of permissions.
es_es: Las clases relacionadas con archivos incluyen <classname>filesystem</classname> para sistemas de archivos, <classname>file</classname> para archivos y <classname>dir</classname> para directorios. Cada clase tiene su propio grupo de permisos asociados.
pt_br: As classes de arquivo relacionado incluem o <classname>filesystem</classname> para sistemas de arquivo, <classname>file</classname> para arquivos e <classname>dir</classname> para diretórios. Cada classe possui o próprio conjunto associado de permissões.

source: This denotes words or phrases encountered on a system, including application names; dialog box text; labeled buttons; check-box and radio button labels; menu titles and sub-menu titles. For example:
es_es: Esto denota palabras o frases que se encuentran en un sistema, incluyendo los nombres de aplicaciones, textos en ventanas, nombres de botones, títulos y de sub-menús. Por ejemplo:
pt_br: Isto descreve palavras ou frases encontradas num sistema, incluindo nomes de aplicativos; texto da caixa de diálogo; botões nomeados; caixa de checagem e nomeações de botões de rádio; títulos de menu e sub-menu. Por exemplo:

source: Choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> from the main menu bar to launch <application>Mouse Preferences</application>. In the <guilabel>Buttons</guilabel> tab, click the <guilabel>Left-handed mouse</guilabel> check box and click <guibutton>Close</guibutton> to switch the primary mouse button from the left to the right (making the mouse suitable for use in the left hand).
es_es: Seleccione <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> de la barra del menú principal para ejecutar <application>Mouse Preferences</application>. En la pestaña <guilabel>Buttons</guilabel>, haga click en la opción <guilabel>Left-handed mouse</guilabel> y haga click en <guibutton>Close</guibutton> para cambiar el botón principal del ratón de la izquierda a la derecha (haciéndolo más apropiado para utilizarlo con la mano izquierda).
pt_br: Escolha <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> a partir da barra de menu principal para lançar <application>Mouse Preferences</application>. Na tab <guilabel>Buttons</guilabel>, clique na caixa de checagem <guilabel>Left-handed mouse</guilabel> e clique no <guibutton>Close</guibutton> para trocar o botão de mouse primário da esquerda para à direita (fazendo o mouse útil para uso com a mão esquerda).

source: To insert a special character into a <application>gedit</application> file, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice> from the main menu bar. Next, choose <menuchoice><guimenu>Search</guimenu><guimenuitem>Find&hellip;</guimenuitem></menuchoice> from the <application>Character Map</application> menu bar, type the name of the character in the <guilabel>Search</guilabel> field and click <guibutton>Next</guibutton>. The character you sought will be highlighted in the <guilabel>Character Table</guilabel>. Double-click this highlighted character to place it in the <guilabel>Text to copy</guilabel> field and then click the <guibutton>Copy</guibutton> button. Now switch back to your document and choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> from the <application>gedit</application> menu bar.
es_es: Para insertar un caracter especial en un archivo <application>gedit</application>, seleccione <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice> de la barra del menú principal. Después escoja <menuchoice><guimenu>Search</guimenu><guimenuitem>Find&hellip;</guimenuitem></menuchoice> de la barra del menú <application>Character Map</application>, escriba el nombre del caracter en el campo <guilabel>Search</guilabel> y haga click en <guibutton>Next</guibutton>. El caracter que buscaba será resaltado en la <guilabel>Character Table</guilabel>. Haga doble click en este caracter para ponerlos en el campo <guilabel>Text to copy</guilabel> y luego haga click en el botón <guibutton>Copy</guibutton>. Ahora regrese a su documento y seleccione <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> de la barra del menú <application>gedit</application>.
pt_br: Para inserir um caractere especial num arquivo <application>gedit</application>, escolha <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice> a partir da barra do menu principal. Em seguida, escolha <menuchoice><guimenu>Search</guimenu><guimenuitem>Find&hellip;</guimenuitem></menuchoice> a partir da barra de menu <application>Character Map</application>, digite o nome do caratere no campo <guilabel>Search</guilabel> e clique em <guibutton>Next</guibutton>. O caractere em que você buscou estará destacado no <guilabel>Character Table</guilabel>. Clique duas vezes neste caractere destacado para posicioná-lo no campo <guilabel>Text to copy</guilabel> e então no botão <guibutton>Copy</guibutton>. Agora volte ao seu documento e escolha <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> a partir da barra do menu <application>gedit</application>.

source: The above text includes application names; system-wide menu names and items; application-specific menu names; and buttons and text found within a GUI interface, all presented in proportional bold and all distinguishable by context.
es_es: El texto anterior incluye nombres de aplicaciones, nombres del menú a nivel del sistema, nombres del menú especificos de aplicaciones y botones y texto que se encuentra dentro de una interfaz GUI, todo presentado en negrilla y distinguible de acuerdo al contexto.
pt_br: O texto acima inclui os nomes do aplicativo, os nomes e itens do menu de sistema; os nomes de menu de aplicativo específico; e os botões e texto encontrados com uma interface GUI, todos apresentados em negrito e distinguidos pelo contexto.

source: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> or <application><replaceable>Proportional Bold Italic</replaceable></application>
es_es: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> o <application><replaceable>Proportional Bold Italic</replaceable></application>
pt_br: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> ou <application><replaceable>Proportional Bold Italic</replaceable></application>

source: Whether mono-spaced bold or proportional bold, the addition of italics indicates replaceable or variable text. Italics denotes text you do not input literally or displayed text that changes depending on circumstance. For example:
es_es: Ya sea negrilla mono-espacio o negrilla proporcional, el agregar letra cursiva indica texto variable o reemplazable. La cursiva denota texto que no introduce literalmente o texto presentado que cambia dependiendo de la circumstancia. Por ejemplo:
pt_br: Sendo negrito mono-espaçado ou negrito proporcional, a adição de itálico indica um texto substituível ou variável. Itálico significa o texto que você não deseje entrar literalmente ou um texto exibido que altera dependendo das circunstâncias. Por exemplo:

source: To connect to a remote machine using ssh, type <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command> at a shell prompt. If the remote machine is <filename>example.com</filename> and your username on that machine is john, type <command>ssh john@example.com</command>.
es_es: Para conectarse a una máquina remota usando ssh, escriba <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command> en un intérprete shell. Si la máquina remota es <filename>example.com</filename> y el nombre de usuario en esa máquina es john, escriba <command>ssh john@example.com</command>.
pt_br: Para conectar uma máquina remota usando ssh, digite <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command> na janela de comando. Caso a máquina seja <filename>example.com</filename> e seu nome do usuário nesta máquina seja john, digite <command>ssh john@example.com</command>.

source: The <command>mount -o remount <replaceable>file-system</replaceable></command> command remounts the named file system. For example, to remount the <filename>/home</filename> file system, the command is <command>mount -o remount /home</command>.
es_es: El comando <command>mount -o remount <replaceable>file-system</replaceable></command> remonta el sistema de archivos nombrado. Por ejemplp, para remontar el sistema de archivos <filename>/home</filename>, el comando es <command>mount -o remount /home</command>.
pt_br: O comando <command>mount -o remount <replaceable>file-system</replaceable></command> remonta o sistema do arquivo nomeado. Por exemplo, para remontar o sistema de arquivo, o comando é <command>mount -o remount /home</command>.

source: To see the version of a currently installed package, use the <command>rpm -q <replaceable>package</replaceable></command> command. It will return a result as follows: <command><replaceable>package-version-release</replaceable></command>.
es_es: Para ver la versión de un paquete actualmente instalado, use el comando <command>rpm -q <replaceable>package</replaceable></command>. Retornará un resultado así: <command><replaceable>package-version-release</replaceable></command>.
pt_br: Para checar a versão de um pacote já instalado, use o comando <command>rpm -q <replaceable>package</replaceable></command>. Ele retornará um resultado conforme segue: <command><replaceable>package-version-release</replaceable></command>.

source: Note the words in bold italics above &mdash; username, domain.name, file-system, package, version and release. Each word is a placeholder, either for text you enter when issuing a command or for text displayed by the system.
es_es: Observe que las palabras anteriores en cursiva y negrilla &mdash; nombre de usuario, nombre del dominio, paquete, versión y lanzamiento. Cada palabra es un posicionador, ya sea para el texto que introduce al emitir un comando o para el texto que el sistema presenta.
pt_br: Perceba que as palavras em itálico e em negrito acima &mdash; username, domain.name, file-system, package, version e release. Cada palavra é um espaço reservado, tanto para o texto que você entra quando entrando um comando ou para um texto exibido pelo sistema.

source: Aside from standard usage for presenting the title of a work, italics denotes the first use of a new and important term. For example:
es_es: Aparte del uso estándar para presentar el título de un trabajo, la cursiva denota el primer uso de un nuevo e importante término. Por ejemplo:
pt_br: Aparte de um uso padrão de representação do título de trabalho, itálico significa o primeiro uso de um novo e importante termo. Por exemplo:

source: Publican is a <firstterm>DocBook</firstterm> publishing system.
es_es: Publican es un sistema de publicación <firstterm>DocBook</firstterm>.
pt_br: Publican é um sistema de publicação <firstterm>DocBook</firstterm>.

source: Pull-quote Conventions
es_es: Convensiones pull-quote
pt_br: Convenções Pull-quote

source: Terminal output and source code listings are set off visually from the surrounding text.
es_es: La salida de la terminal y los listados del código fuente se establecen visualmente desde el texto que lo rodea.
pt_br: O resultado do terminal e as listagens de código de fonte são configurados visualmente a partir do texto em volta.

source: Output sent to a terminal is set in <computeroutput>mono-spaced roman</computeroutput> and presented thus:
es_es: La salida enviada a la terminal se configura en <computeroutput>mono-spaced roman</computeroutput> y se presenta así:
pt_br: O resultado enviado a um terminal é configurado em um <computeroutput>mono-spaced roman</computeroutput> e apresentado, dessa forma:

source: Source-code listings are also set in <computeroutput>mono-spaced roman</computeroutput> but add syntax highlighting as follows:
es_es: Los listados de código fuente también se configuran en <computeroutput>mono-spaced roman</computeroutput> pero agregan el resaltado de sintaxis así:
pt_br: Listagens de fonte de código são também configuradas em <computeroutput>mono-spaced roman</computeroutput>, porém adicionam o destaque da sintaxe, conforme segue abaixo:

source: Notes and Warnings
es_es: Notas y advertencias
pt_br: Notas e Avisos

source: Finally, we use three visual styles to draw attention to information that might otherwise be overlooked.
es_es: Finalmente, utilizamos tres estilos visuales para llamar la atención a cierta información que de otra manera se podría pasar por alto.
pt_br: Finalmente, nós usamos os três estilos visuais para chamar atenção à informação que poderá de outra forma ser despercebida.

source: Note
es_es: Nota
pt_br: Nota

source: Notes are tips, shortcuts or alternative approaches to the task at hand. Ignoring a note should have no negative consequences, but you might miss out on a trick that makes your life easier.
es_es: Las notas son tips o enfoques opcionales para la tarea dada. El ignorar una nota no debe tener nunguna consecuencia negativa pero puede que se salte algún truco que le pueda hacer la vida más fácil.
pt_br: As notas são dicas, desvios ou abordagens alternativas à tarefa em mãos. O ato de ignorar uma nota não deve ter consequências negativas, porém você poderá perder uma dica que facilitaria o seu processo.

source: Important
es_es: Importante
pt_br: Importante

source: Important boxes detail things that are easily missed: configuration changes that only apply to the current session, or services that need restarting before an update will apply. Ignoring a box labeled 'Important' won't cause data loss but may cause irritation and frustration.
es_es: Las ventanas importantes anotan cosas que se pueden olvidar con facilidad: cambios en la configuración que solo aplican a la sesión actual o servicios que es necesario reiniciar antes de que una actualización se aplique. El ignorar una ventana de 'Importante' no hará que se pierdan datos pero puede llegarle a causar algo de frustración.
pt_br: As caixas importantes descrevem detalhes que são facilmente esquecidos: alterações de configurações que apenas aplicam a sessão atual, ou serviços que precisam ser reiniciados antes de uma atualização ser aplicada. Ignorando uma caixa nomeada 'Importante' não causará perda de dados, porém poderá causar irritação ou frustração.

source: Warning
es_es: Advertencia
pt_br: Aviso

source: Warnings should not be ignored. Ignoring warnings will most likely cause data loss.
es_es: Las advertencias no se deben ignorar. El ignorarlas muy posiblemente le causará pérdida de datos.
pt_br: Os avisos não devem ser ignorados. Caso eles sejam ignorados, isto poderá causar perda de dados.
